[Killed] BlockStatement
src/EventProcessorService.ts:23:5
   constructor(
       logger: Logger,
       configService: ConfigService,
-  ) {
-    this.sqsService = new SQSService();
-    this.logger = logger;
-    this.configService = configService;
-
-    this.eventFactory = new EventFactory(this.configService, this.logger, this.sqsService);
-    this.eventFetcher = new EventFetcherRPC(configService.getMainRPCURL(), configService.getAlternativeRPCURL());
-  }
+  ) {}
 
   public async execute(): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:32:41
     this.eventFetcher = new EventFetcherRPC(configService.getMainRPCURL(), configService.getAlternativeRPCURL());
   }
 
-  public async execute(): Promise<void> {
-    try {
-      this.logger.info('Executing the event fetcher workflow...');
-      this.logger.info(`RPC: ${this.configService.getMainRPCURL()}\n
-                        SQS queue: ${this.configService.getEventQueueURL()}\n
-                        Env: ${this.configService.getEnvironment()}`);
-
-      const startBlock = await this.getStartBlockNumber();
-      const endBlock = await this.eventFetcher.getCurrentBlockNumber();
-
-      await this.processEventsAtBlockRange(startBlock, endBlock);
-
-      await this.configService.setLastScannedBlock(endBlock);
-
-      this.logger.info('Event fetcher workflow completed.');
-    } catch (error) {
-      this.logger.error(`Error in event fetcher workflow: ${error}`);
-      console.error('Error in event fetcher workflow:', error);
-    } finally {
-      await this.logger.flush();
-    }
-  }
+  public async execute(): Promise<void> {}
 
   private async processEventsAtBlockRange(startBlock: number, endBlock: number): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:33:9
   }
 
   public async execute(): Promise<void> {
-    try {
-      this.logger.info('Executing the event fetcher workflow...');
-      this.logger.info(`RPC: ${this.configService.getMainRPCURL()}\n
-                        SQS queue: ${this.configService.getEventQueueURL()}\n
-                        Env: ${this.configService.getEnvironment()}`);
-
-      const startBlock = await this.getStartBlockNumber();
-      const endBlock = await this.eventFetcher.getCurrentBlockNumber();
-
-      await this.processEventsAtBlockRange(startBlock, endBlock);
-
-      await this.configService.setLastScannedBlock(endBlock);
-
-      this.logger.info('Event fetcher workflow completed.');
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(`Error in event fetcher workflow: ${error}`);
       console.error('Error in event fetcher workflow:', error);
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] BlockStatement
src/EventProcessorService.ts:47:21
       await this.configService.setLastScannedBlock(endBlock);
 
       this.logger.info('Event fetcher workflow completed.');
-    } catch (error) {
-      this.logger.error(`Error in event fetcher workflow: ${error}`);
-      console.error('Error in event fetcher workflow:', error);
-    } finally {
+    } catch (error) {} finally {
       await this.logger.flush();
     }

[Killed] BlockStatement
src/EventProcessorService.ts:50:15
     } catch (error) {
       this.logger.error(`Error in event fetcher workflow: ${error}`);
       console.error('Error in event fetcher workflow:', error);
-    } finally {
-      await this.logger.flush();
-    }
+    } finally {}
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:55:96
     }
   }
 
-  private async processEventsAtBlockRange(startBlock: number, endBlock: number): Promise<void> {
-    for (
-      let currentStepStartBlock = startBlock + 1;
-      currentStepStartBlock <= endBlock;
-      currentStepStartBlock += this.configService.getEventsFetchPageSize()
-    ) {
-      const currentStepEndBlock = Math.min(
-          currentStepStartBlock + this.configService.getEventsFetchPageSize() - 1,
-          endBlock,
-      );
-
-      const eventLogGroup = await this.eventFetcher.getOnChainEvents(
-          currentStepStartBlock,
-          currentStepEndBlock,
-          ALL_TOPICS,
-      );
-
-      await this.processLogGroup(eventLogGroup);
-    }
-  }
+  private async processEventsAtBlockRange(startBlock: number, endBlock: number): Promise<void> {}
 
   private async processLogGroup(eventLogGroup: ethers.providers.Log[]): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArithmeticOperator
src/EventProcessorService.ts:57:35
 
   private async processEventsAtBlockRange(startBlock: number, endBlock: number): Promise<void> {
     for (
-      let currentStepStartBlock = startBlock + 1;
+      let currentStepStartBlock = startBlock - 1;
       currentStepStartBlock <= endBlock;
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/EventProcessorService.ts:58:7
   private async processEventsAtBlockRange(startBlock: number, endBlock: number): Promise<void> {
     for (
       let currentStepStartBlock = startBlock + 1;
-      currentStepStartBlock <= endBlock;
+      currentStepStartBlock > endBlock;
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
     ) {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/EventProcessorService.ts:58:7
   private async processEventsAtBlockRange(startBlock: number, endBlock: number): Promise<void> {
     for (
       let currentStepStartBlock = startBlock + 1;
-      currentStepStartBlock <= endBlock;
+      false;
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
     ) {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Timeout] AssignmentOperator
src/EventProcessorService.ts:59:7
     for (
       let currentStepStartBlock = startBlock + 1;
       currentStepStartBlock <= endBlock;
-      currentStepStartBlock += this.configService.getEventsFetchPageSize()
+      currentStepStartBlock -= this.configService.getEventsFetchPageSize()
     ) {
       const currentStepEndBlock = Math.min(

[Killed] BlockStatement
src/EventProcessorService.ts:60:7
       let currentStepStartBlock = startBlock + 1;
       currentStepStartBlock <= endBlock;
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
-    ) {
-      const currentStepEndBlock = Math.min(
-          currentStepStartBlock + this.configService.getEventsFetchPageSize() - 1,
-          endBlock,
-      );
-
-      const eventLogGroup = await this.eventFetcher.getOnChainEvents(
-          currentStepStartBlock,
-          currentStepEndBlock,
-          ALL_TOPICS,
-      );
-
-      await this.processLogGroup(eventLogGroup);
-    }
+    ) {}
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] MethodExpression
src/EventProcessorService.ts:61:35
       currentStepStartBlock <= endBlock;
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
     ) {
-      const currentStepEndBlock = Math.min(
-          currentStepStartBlock + this.configService.getEventsFetchPageSize() - 1,
-          endBlock,
-      );
+      const currentStepEndBlock = Math.max(currentStepStartBlock + this.configService.getEventsFetchPageSize() - 1, endBlock);
 
       const eventLogGroup = await this.eventFetcher.getOnChainEvents(
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArithmeticOperator
src/EventProcessorService.ts:62:11
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
     ) {
       const currentStepEndBlock = Math.min(
-          currentStepStartBlock + this.configService.getEventsFetchPageSize() - 1,
+          currentStepStartBlock + this.configService.getEventsFetchPageSize() + 1,
           endBlock,
       );
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArithmeticOperator
src/EventProcessorService.ts:62:11
       currentStepStartBlock += this.configService.getEventsFetchPageSize()
     ) {
       const currentStepEndBlock = Math.min(
-          currentStepStartBlock + this.configService.getEventsFetchPageSize() - 1,
+          currentStepStartBlock - this.configService.getEventsFetchPageSize() - 1,
           endBlock,
       );
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:76:87
     }
   }
 
-  private async processLogGroup(eventLogGroup: ethers.providers.Log[]): Promise<void> {
-    for (const event of eventLogGroup) {
-      try {
-        const evt = await this.eventFactory.createEvent(event);
-        evt.process();
-      } catch (error) {
-        if (error instanceof EventFactoryUnknownEventError) {
-          continue;
-        }
-      }
-    }
-  }
+  private async processLogGroup(eventLogGroup: ethers.providers.Log[]): Promise<void> {}
 
   private async getStartBlockNumber(): Promise<number> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:77:40
   }
 
   private async processLogGroup(eventLogGroup: ethers.providers.Log[]): Promise<void> {
-    for (const event of eventLogGroup) {
-      try {
-        const evt = await this.eventFactory.createEvent(event);
-        evt.process();
-      } catch (error) {
-        if (error instanceof EventFactoryUnknownEventError) {
-          continue;
-        }
-      }
-    }
+    for (const event of eventLogGroup) {}
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:78:11
 
   private async processLogGroup(eventLogGroup: ethers.providers.Log[]): Promise<void> {
     for (const event of eventLogGroup) {
-      try {
-        const evt = await this.eventFactory.createEvent(event);
-        evt.process();
-      } catch (error) {
+      try {} catch (error) {
         if (error instanceof EventFactoryUnknownEventError) {
           continue;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:81:23
       try {
         const evt = await this.eventFactory.createEvent(event);
         evt.process();
-      } catch (error) {
-        if (error instanceof EventFactoryUnknownEventError) {
-          continue;
-        }
-      }
+      } catch (error) {}
     }
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:82:61
         const evt = await this.eventFactory.createEvent(event);
         evt.process();
       } catch (error) {
-        if (error instanceof EventFactoryUnknownEventError) {
-          continue;
-        }
+        if (error instanceof EventFactoryUnknownEventError) {}
       }
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/EventProcessorService.ts:82:13
         const evt = await this.eventFactory.createEvent(event);
         evt.process();
       } catch (error) {
-        if (error instanceof EventFactoryUnknownEventError) {
+        if (false) {
           continue;
         }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:89:56
     }
   }
 
-  private async getStartBlockNumber(): Promise<number> {
-    const MaxNumberOfBlocksToProess = this.configService.getMaxNumberOfBlocksToProcess();
-    const currentBlockNumber = await this.eventFetcher.getCurrentBlockNumber();
-    const defaultBlockNumber = Math.max(currentBlockNumber - MaxNumberOfBlocksToProess, 0);
-    const lastBlockScanned = this.configService.getLastBlockScanned();
-
-    if (lastBlockScanned == 0 ||
-      currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
-      lastBlockScanned > currentBlockNumber) {
-      return defaultBlockNumber;
-    }
-
-    return lastBlockScanned;
-  }
+  private async getStartBlockNumber(): Promise<number> {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArithmeticOperator
src/EventProcessorService.ts:92:41
   private async getStartBlockNumber(): Promise<number> {
     const MaxNumberOfBlocksToProess = this.configService.getMaxNumberOfBlocksToProcess();
     const currentBlockNumber = await this.eventFetcher.getCurrentBlockNumber();
-    const defaultBlockNumber = Math.max(currentBlockNumber - MaxNumberOfBlocksToProess, 0);
+    const defaultBlockNumber = Math.max(currentBlockNumber + MaxNumberOfBlocksToProess, 0);
     const lastBlockScanned = this.configService.getLastBlockScanned();
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Timeout] MethodExpression
src/EventProcessorService.ts:92:32
   private async getStartBlockNumber(): Promise<number> {
     const MaxNumberOfBlocksToProess = this.configService.getMaxNumberOfBlocksToProcess();
     const currentBlockNumber = await this.eventFetcher.getCurrentBlockNumber();
-    const defaultBlockNumber = Math.max(currentBlockNumber - MaxNumberOfBlocksToProess, 0);
+    const defaultBlockNumber = Math.min(currentBlockNumber - MaxNumberOfBlocksToProess, 0);
     const lastBlockScanned = this.configService.getLastBlockScanned();
 

[Killed] ConditionalExpression
src/EventProcessorService.ts:95:9
     const defaultBlockNumber = Math.max(currentBlockNumber - MaxNumberOfBlocksToProess, 0);
     const lastBlockScanned = this.configService.getLastBlockScanned();
 
-    if (lastBlockScanned == 0 ||
-      currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
-      lastBlockScanned > currentBlockNumber) {
+    if (true) {
       return defaultBlockNumber;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/EventProcessorService.ts:95:9
     const defaultBlockNumber = Math.max(currentBlockNumber - MaxNumberOfBlocksToProess, 0);
     const lastBlockScanned = this.configService.getLastBlockScanned();
 
-    if (lastBlockScanned == 0 ||
-      currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
-      lastBlockScanned > currentBlockNumber) {
+    if (false) {
       return defaultBlockNumber;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/EventProcessorService.ts:96:7
     const lastBlockScanned = this.configService.getLastBlockScanned();
 
     if (lastBlockScanned == 0 ||
-      currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
+      false ||
       lastBlockScanned > currentBlockNumber) {
       return defaultBlockNumber;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/EventProcessorService.ts:96:7
     const lastBlockScanned = this.configService.getLastBlockScanned();
 
     if (lastBlockScanned == 0 ||
-      currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
+      currentBlockNumber - lastBlockScanned <= MaxNumberOfBlocksToProess ||
       lastBlockScanned > currentBlockNumber) {
       return defaultBlockNumber;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/EventProcessorService.ts:97:46
 
     if (lastBlockScanned == 0 ||
       currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
-      lastBlockScanned > currentBlockNumber) {
-      return defaultBlockNumber;
-    }
+      lastBlockScanned > currentBlockNumber) {}
 
     return lastBlockScanned;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/EventProcessorService.ts:97:7
 
     if (lastBlockScanned == 0 ||
       currentBlockNumber - lastBlockScanned > MaxNumberOfBlocksToProess ||
-      lastBlockScanned > currentBlockNumber) {
+      false) {
       return defaultBlockNumber;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
