[Killed] BlockStatement
src/lambda-handler.ts:10:21
     _event: any,
     // eslint-disable-next-line @typescript-eslint/no-unused-vars, @typescript-eslint/no-explicit-any
     _context: any,
-): Promise<void> => {
-  Logger.initialize('Events fetcher');
-  const logger = Logger.getInstance();
-
-  try {
-    const environment = process.env.ENVIRONMENT as string;
-    const region = process.env.AWS_REGION as string;
-    const configService: ConfigServiceAWS = new ConfigServiceAWS(environment, region);
-    await configService.refreshConfig();
-
-    const eventProcessorService = new EventProcessorService(logger, configService);
-
-    await eventProcessorService.execute();
-  // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  } catch (ex: any) {
-    console.log('Error:', (ex as Error).message);
-  } finally {
-    await logger.flush();
-  }
-};
+): Promise<void> => {};
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/lambda-handler.ts:14:7
   Logger.initialize('Events fetcher');
   const logger = Logger.getInstance();
 
-  try {
-    const environment = process.env.ENVIRONMENT as string;
-    const region = process.env.AWS_REGION as string;
-    const configService: ConfigServiceAWS = new ConfigServiceAWS(environment, region);
-    await configService.refreshConfig();
-
-    const eventProcessorService = new EventProcessorService(logger, configService);
-
-    await eventProcessorService.execute();
-  // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  } catch (ex: any) {
+  try {} catch (ex: any) {
     console.log('Error:', (ex as Error).message);
   } finally {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] BlockStatement
src/lambda-handler.ts:24:21
 
     await eventProcessorService.execute();
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  } catch (ex: any) {
-    console.log('Error:', (ex as Error).message);
-  } finally {
+  } catch (ex: any) {} finally {
     await logger.flush();
   }

[Survived] StringLiteral
src/lambda-handler.ts:25:17
     await eventProcessorService.execute();
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   } catch (ex: any) {
-    console.log('Error:', (ex as Error).message);
+    console.log("", (ex as Error).message);
   } finally {
     await logger.flush();

[Survived] BlockStatement
src/lambda-handler.ts:26:13
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   } catch (ex: any) {
     console.log('Error:', (ex as Error).message);
-  } finally {
-    await logger.flush();
-  }
+  } finally {}
 };
 
