[Killed] BlockStatement
src/onchain_events/EventFactory.ts:23:32
 } from './EventTopic';
 
 export class EventFactoryUnknownEventError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'EventFactoryUnknownEventError';
-  }
+  constructor(message: string) {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] StringLiteral
src/onchain_events/EventFactory.ts:25:17
 export class EventFactoryUnknownEventError extends Error {
   constructor(message: string) {
     super(message);
-    this.name = 'EventFactoryUnknownEventError';
+    this.name = "";
   }
 }

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:34:85
   private logger: Logger;
   private sqsService: SQSService;
 
-  constructor(configService: ConfigService, logger: Logger, sqsService: SQSService) {
-    this.configService = configService;
-    this.logger = logger;
-    this.sqsService = sqsService;
-  }
+  constructor(configService: ConfigService, logger: Logger, sqsService: SQSService) {}
 
   public async createEvent(eventLog: ethers.providers.Log): Promise<OnChainEvent> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:40:83
     this.sqsService = sqsService;
   }
 
-  public async createEvent(eventLog: ethers.providers.Log): Promise<OnChainEvent> {
-    if (eventLog === undefined) {
-      throw new EventFactoryUnknownEventError('Event log has no topics');
-    }
-
-    const results = await Promise.all([
-      this.createPSPEvent(eventLog),
-      this.createLeverageEvent(eventLog),
-    ]);
-
-    const event = this.getEventObjectOrThrowError(results, eventLog);
-
-    return event;
-  }
+  public async createEvent(eventLog: ethers.providers.Log): Promise<OnChainEvent> {}
 
   private createPSPEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:41:33
   }
 
   public async createEvent(eventLog: ethers.providers.Log): Promise<OnChainEvent> {
-    if (eventLog === undefined) {
-      throw new EventFactoryUnknownEventError('Event log has no topics');
-    }
+    if (eventLog === undefined) {}
 
     const results = await Promise.all([
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:41:9
   }
 
   public async createEvent(eventLog: ethers.providers.Log): Promise<OnChainEvent> {
-    if (eventLog === undefined) {
+    if (true) {
       throw new EventFactoryUnknownEventError('Event log has no topics');
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:55:84
     return event;
   }
 
-  private createPSPEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
-    if (this.isLogEventEmittedByPSPContract(eventLog) === false) {
-      return undefined;
-    }
-
-    switch (eventLog.topics[0]) {
-      case TOPIC_EVENT_PSP_DEPOSIT:
-        return new OnChainEventPSPDeposit(eventLog, this.logger, this.sqsService, this.configService);
-
-      case TOPIC_EVENT_PSP_WITHDRAW:
-        return new OnChainEventPSPWithdraw(eventLog, this.logger, this.sqsService, this.configService);
-    }
-
-    return undefined;
-  }
+  private createPSPEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {}
 
   private createLeverageEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BooleanLiteral
src/onchain_events/EventFactory.ts:56:59
   }
 
   private createPSPEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
-    if (this.isLogEventEmittedByPSPContract(eventLog) === false) {
+    if (this.isLogEventEmittedByPSPContract(eventLog) === true) {
       return undefined;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:56:66
   }
 
   private createPSPEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
-    if (this.isLogEventEmittedByPSPContract(eventLog) === false) {
-      return undefined;
-    }
+    if (this.isLogEventEmittedByPSPContract(eventLog) === false) {}
 
     switch (eventLog.topics[0]) {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:61:7
     }
 
     switch (eventLog.topics[0]) {
-      case TOPIC_EVENT_PSP_DEPOSIT:
-        return new OnChainEventPSPDeposit(eventLog, this.logger, this.sqsService, this.configService);
+      case TOPIC_EVENT_PSP_DEPOSIT:
 
       case TOPIC_EVENT_PSP_WITHDRAW:
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:64:7
       case TOPIC_EVENT_PSP_DEPOSIT:
         return new OnChainEventPSPDeposit(eventLog, this.logger, this.sqsService, this.configService);
 
-      case TOPIC_EVENT_PSP_WITHDRAW:
-        return new OnChainEventPSPWithdraw(eventLog, this.logger, this.sqsService, this.configService);
+      case TOPIC_EVENT_PSP_WITHDRAW:
     }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:71:89
     return undefined;
   }
 
-  private createLeverageEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
-    if (this.isLogEventEmittedByLeverageContract(eventLog) === false) {
-      return undefined;
-    }
-
-    switch (eventLog.topics[0]) {
-      case TOPIC_EVENT_LEVERAGE_POSITION_OPENED:
-        return new OnChainEventLeveragePositionOpened(eventLog, this.logger, this.sqsService, this.configService);
-
-      case TOPIC_EVENT_LEVERAGE_POSITION_CLOSED:
-        return new OnChainEventLeveragePositionClosed(eventLog, this.logger, this.sqsService, this.configService);
-
-      case TOPIC_EVENT_LEVERAGE_POSITION_LIQUIDATED:
-        return new OnChainEventLeveragePositionLiquidated(eventLog, this.logger, this.sqsService, this.configService);
-
-      case TOPIC_EVENT_LEVERAGE_POSITION_EXPIRED:
-        return new OnChainEventLeveragePositionExpired(eventLog, this.logger, this.sqsService, this.configService);
-    }
-
-    return undefined;
-  }
+  private createLeverageEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {}
 
   private getEventObjectOrThrowError(results: [OnChainEvent | undefined, OnChainEvent | undefined],
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/EventFactory.ts:72:9
   }
 
   private createLeverageEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
-    if (this.isLogEventEmittedByLeverageContract(eventLog) === false) {
+    if (this.isLogEventEmittedByLeverageContract(eventLog) !== false) {
       return undefined;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:72:71
   }
 
   private createLeverageEvent(eventLog: ethers.providers.Log): OnChainEvent | undefined {
-    if (this.isLogEventEmittedByLeverageContract(eventLog) === false) {
-      return undefined;
-    }
+    if (this.isLogEventEmittedByLeverageContract(eventLog) === false) {}
 
     switch (eventLog.topics[0]) {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:77:7
     }
 
     switch (eventLog.topics[0]) {
-      case TOPIC_EVENT_LEVERAGE_POSITION_OPENED:
-        return new OnChainEventLeveragePositionOpened(eventLog, this.logger, this.sqsService, this.configService);
+      case TOPIC_EVENT_LEVERAGE_POSITION_OPENED:
 
       case TOPIC_EVENT_LEVERAGE_POSITION_CLOSED:
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:80:7
       case TOPIC_EVENT_LEVERAGE_POSITION_OPENED:
         return new OnChainEventLeveragePositionOpened(eventLog, this.logger, this.sqsService, this.configService);
 
-      case TOPIC_EVENT_LEVERAGE_POSITION_CLOSED:
-        return new OnChainEventLeveragePositionClosed(eventLog, this.logger, this.sqsService, this.configService);
+      case TOPIC_EVENT_LEVERAGE_POSITION_CLOSED:
 
       case TOPIC_EVENT_LEVERAGE_POSITION_LIQUIDATED:
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:83:7
       case TOPIC_EVENT_LEVERAGE_POSITION_CLOSED:
         return new OnChainEventLeveragePositionClosed(eventLog, this.logger, this.sqsService, this.configService);
 
-      case TOPIC_EVENT_LEVERAGE_POSITION_LIQUIDATED:
-        return new OnChainEventLeveragePositionLiquidated(eventLog, this.logger, this.sqsService, this.configService);
+      case TOPIC_EVENT_LEVERAGE_POSITION_LIQUIDATED:
 
       case TOPIC_EVENT_LEVERAGE_POSITION_EXPIRED:
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:86:7
       case TOPIC_EVENT_LEVERAGE_POSITION_LIQUIDATED:
         return new OnChainEventLeveragePositionLiquidated(eventLog, this.logger, this.sqsService, this.configService);
 
-      case TOPIC_EVENT_LEVERAGE_POSITION_EXPIRED:
-        return new OnChainEventLeveragePositionExpired(eventLog, this.logger, this.sqsService, this.configService);
+      case TOPIC_EVENT_LEVERAGE_POSITION_EXPIRED:
     }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:94:53
   }
 
   private getEventObjectOrThrowError(results: [OnChainEvent | undefined, OnChainEvent | undefined],
-      eventLog: ethers.providers.Log): OnChainEvent {
-    if (results.every((result) => result === undefined)) {
-      const errorMessage = `Unknown event topic, ${eventLog.topics[0]}`;
-      this.logger.error(errorMessage);
-      throw new EventFactoryUnknownEventError(errorMessage);
-    }
-
-    // this should NOT happen
-    if (results.every((result) => result !== undefined)) {
-      const errorMessage = `Multiple events detected, but expecting just one: ${eventLog.topics[0]}`;
-      this.logger.error(errorMessage);
-      throw new EventFactoryUnknownEventError(errorMessage);
-    }
-
-    const event = results.find((result) => result !== undefined);
-
-    return event as unknown as OnChainEvent;
-  }
+      eventLog: ethers.providers.Log): OnChainEvent {}
 
   private isLogEventEmittedByPSPContract(eventLog: ethers.providers.Log): boolean {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:95:35
 
   private getEventObjectOrThrowError(results: [OnChainEvent | undefined, OnChainEvent | undefined],
       eventLog: ethers.providers.Log): OnChainEvent {
-    if (results.every((result) => result === undefined)) {
+    if (results.every((result) => true)) {
       const errorMessage = `Unknown event topic, ${eventLog.topics[0]}`;
       this.logger.error(errorMessage);
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] MethodExpression
src/onchain_events/EventFactory.ts:95:9
 
   private getEventObjectOrThrowError(results: [OnChainEvent | undefined, OnChainEvent | undefined],
       eventLog: ethers.providers.Log): OnChainEvent {
-    if (results.every((result) => result === undefined)) {
+    if (results.some(result => result === undefined)) {
       const errorMessage = `Unknown event topic, ${eventLog.topics[0]}`;
       this.logger.error(errorMessage);
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:102:35
     }
 
     // this should NOT happen
-    if (results.every((result) => result !== undefined)) {
+    if (results.every((result) => true)) {
       const errorMessage = `Multiple events detected, but expecting just one: ${eventLog.topics[0]}`;
       this.logger.error(errorMessage);
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:102:58
     }
 
     // this should NOT happen
-    if (results.every((result) => result !== undefined)) {
-      const errorMessage = `Multiple events detected, but expecting just one: ${eventLog.topics[0]}`;
-      this.logger.error(errorMessage);
-      throw new EventFactoryUnknownEventError(errorMessage);
-    }
+    if (results.every((result) => result !== undefined)) {}
 
     const event = results.find((result) => result !== undefined);
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] StringLiteral
src/onchain_events/EventFactory.ts:103:28
 
     // this should NOT happen
     if (results.every((result) => result !== undefined)) {
-      const errorMessage = `Multiple events detected, but expecting just one: ${eventLog.topics[0]}`;
+      const errorMessage = ``;
       this.logger.error(errorMessage);
       throw new EventFactoryUnknownEventError(errorMessage);

[Killed] ArrowFunction
src/onchain_events/EventFactory.ts:108:32
       throw new EventFactoryUnknownEventError(errorMessage);
     }
 
-    const event = results.find((result) => result !== undefined);
+    const event = results.find(() => undefined);
 
     return event as unknown as OnChainEvent;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/EventFactory.ts:108:44
       throw new EventFactoryUnknownEventError(errorMessage);
     }
 
-    const event = results.find((result) => result !== undefined);
+    const event = results.find((result) => result === undefined);
 
     return event as unknown as OnChainEvent;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:113:83
     return event as unknown as OnChainEvent;
   }
 
-  private isLogEventEmittedByPSPContract(eventLog: ethers.providers.Log): boolean {
-    const res = this.configService.getPSPStrategyInfoByAddress(eventLog.address);
-
-    if (res === undefined) {
-      return false;
-    }
-    return true;
-  }
+  private isLogEventEmittedByPSPContract(eventLog: ethers.providers.Log): boolean {}
 
   private isLogEventEmittedByLeverageContract(eventLog: ethers.providers.Log): boolean {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/EventFactory.ts:116:9
   private isLogEventEmittedByPSPContract(eventLog: ethers.providers.Log): boolean {
     const res = this.configService.getPSPStrategyInfoByAddress(eventLog.address);
 
-    if (res === undefined) {
+    if (res !== undefined) {
       return false;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:116:9
   private isLogEventEmittedByPSPContract(eventLog: ethers.providers.Log): boolean {
     const res = this.configService.getPSPStrategyInfoByAddress(eventLog.address);
 
-    if (res === undefined) {
+    if (true) {
       return false;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BooleanLiteral
src/onchain_events/EventFactory.ts:117:14
     const res = this.configService.getPSPStrategyInfoByAddress(eventLog.address);
 
     if (res === undefined) {
-      return false;
+      return true;
     }
     return true;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:122:88
     return true;
   }
 
-  private isLogEventEmittedByLeverageContract(eventLog: ethers.providers.Log): boolean {
-    const emitterAddress = eventLog.address;
-
-    if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
-      this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
-      this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
-      this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
-      return true;
-    }
-    return false;
-  }
+  private isLogEventEmittedByLeverageContract(eventLog: ethers.providers.Log): boolean {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:125:9
   private isLogEventEmittedByLeverageContract(eventLog: ethers.providers.Log): boolean {
     const emitterAddress = eventLog.address;
 
-    if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
-      this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
-      this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
-      this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
+    if (false) {
       return true;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:125:9
   private isLogEventEmittedByLeverageContract(eventLog: ethers.providers.Log): boolean {
     const emitterAddress = eventLog.address;
 
-    if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
-      this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
-      this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
+    if (false ||
       this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
       return true;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/EventFactory.ts:126:7
     const emitterAddress = eventLog.address;
 
     if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
-      this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
+      this.configService.getLeveragePositionCloserAddress() !== emitterAddress ||
       this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
       this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:126:7
     const emitterAddress = eventLog.address;
 
     if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
-      this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
+      false ||
       this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
       this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/EventFactory.ts:127:7
 
     if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
       this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
-      this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
+      this.configService.getLeveragePositionLiquidatorAddress() !== emitterAddress ||
       this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
       return true;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/EventFactory.ts:127:7
 
     if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
       this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
-      this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
+      false ||
       this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
       return true;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/EventFactory.ts:128:84
     if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
       this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
       this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
-      this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
-      return true;
-    }
+      this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {}
     return false;
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/EventFactory.ts:128:7
     if (this.configService.getLeveragePositionOpenerAddress() === emitterAddress ||
       this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
       this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
-      this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
+      this.configService.getLeveragePositionExpiratorAddress() !== emitterAddress) {
       return true;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
