[Killed] BooleanLiteral
src/onchain_events/EventFactory.ts:129:14
       this.configService.getLeveragePositionCloserAddress() === emitterAddress ||
       this.configService.getLeveragePositionLiquidatorAddress() === emitterAddress ||
       this.configService.getLeveragePositionExpiratorAddress() === emitterAddress) {
-      return true;
+      return false;
     }
     return false;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
