[Killed] StringLiteral
src/onchain_events/EventTopic.ts:6:53
 export const TOPIC_EVENT_PSP_WITHDRAW = '0xfbde797d201c681b91056529119e0b02407c7bb96a4a2c75c01fc9667232c8db';
 
 export const TOPIC_EVENT_LEVERAGE_POSITION_OPENED = '0x80feb7c33cd39a42e347b6b7577a63af2c7a96c236e85c200c8f39e11be679dd';
-export const TOPIC_EVENT_LEVERAGE_POSITION_CLOSED = '0x3120c845c5d2c39308641201562a412527c1e7aff294f09c0c936f1c60a1b067';
+export const TOPIC_EVENT_LEVERAGE_POSITION_CLOSED = "";
 export const TOPIC_EVENT_LEVERAGE_POSITION_LIQUIDATED = '0x5564304997c5a4b15399de434a73fbc4339eae8f1b5b2875d0feac2826ce33d2';
 export const TOPIC_EVENT_LEVERAGE_POSITION_EXPIRED = '0x412514176d888af8c5fdb2ccf226830116c0cc86036a8f50a8ae8fb12d348d78';
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
