[Killed] BlockStatement
src/onchain_events/OnChainEvent.ts:17:120
   protected sqsService: SQSService;
   protected configService: ConfigService;
 
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    this.logger = logger;
-    this.sqsService = sqsService;
-    this.configService = configService;
-
-    this.txHash = rawEventLog.transactionHash;
-    this.blockNumber = rawEventLog.blockNumber;
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   abstract process(): void;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/OnChainEvent.ts:28:33
 
   abstract process(): void;
 
-  public getEventName(): string {
-    return this.eventName;
-  }
+  public getEventName(): string {}
 
   protected findStrategyConfigBStrategyAddress(strategyAddress: string): ContractInfoPSP {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/OnChainEvent.ts:32:90
     return this.eventName;
   }
 
-  protected findStrategyConfigBStrategyAddress(strategyAddress: string): ContractInfoPSP {
-    const res = this.configService.getPSPStrategyInfoByAddress(strategyAddress);
-    if (res === undefined) {
-      throw new Error(`Unknown strategy address: ${strategyAddress}`);
-    }
-
-    return res;
-  }
+  protected findStrategyConfigBStrategyAddress(strategyAddress: string): ContractInfoPSP {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/onchain_events/OnChainEvent.ts:34:9
 
   protected findStrategyConfigBStrategyAddress(strategyAddress: string): ContractInfoPSP {
     const res = this.configService.getPSPStrategyInfoByAddress(strategyAddress);
-    if (res === undefined) {
+    if (true) {
       throw new Error(`Unknown strategy address: ${strategyAddress}`);
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/onchain_events/OnChainEvent.ts:34:9
 
   protected findStrategyConfigBStrategyAddress(strategyAddress: string): ContractInfoPSP {
     const res = this.configService.getPSPStrategyInfoByAddress(strategyAddress);
-    if (res === undefined) {
+    if (res !== undefined) {
       throw new Error(`Unknown strategy address: ${strategyAddress}`);
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] StringLiteral
src/onchain_events/OnChainEvent.ts:35:23
   protected findStrategyConfigBStrategyAddress(strategyAddress: string): ContractInfoPSP {
     const res = this.configService.getPSPStrategyInfoByAddress(strategyAddress);
     if (res === undefined) {
-      throw new Error(`Unknown strategy address: ${strategyAddress}`);
+      throw new Error(``);
     }
 
