[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeverage.ts:7:26
 export abstract class OnChainEventLeverage extends OnChainEvent {
   protected nftId!: number;
 
-  public process(): void {
-    this.logLeverageEvent();
-    this.sendSqsLeverageEvent();
-  }
+  public process(): void {}
 
   protected abstract getSQSMessage(): EventFetcherSQSMessage;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeverage.ts:15:40
   protected abstract getSQSMessage(): EventFetcherSQSMessage;
   protected abstract logLeverageEvent(): void;
 
-  private sendSqsLeverageEvent(): void {
-    const sqsMessage = JSON.stringify(this.getSQSMessage());
-    const queueUrl = this.configService.getEventQueueURL();
-    this.sqsService.sendMessage(queueUrl, sqsMessage);
-  }
+  private sendSqsLeverageEvent(): void {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
