[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:12:120
   private receivedAmount!: bigint;
   private debtAmount!: bigint;
 
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    super(rawEventLog, logger, sqsService, configService);
-    this.eventName = 'LeveragedPositionClosed';
-    this.parseEventLog(rawEventLog);
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   protected parseEventLog(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:18:65
     this.parseEventLog(rawEventLog);
   }
 
-  protected parseEventLog(eventLog: ethers.providers.Log): void {
-    this.setUserAddressFromEventLog(eventLog);
-    this.setNftIdFromEventLogTopic(eventLog);
-    this.setPositionAmountsFromEventLogData(eventLog);
-  }
+  protected parseEventLog(eventLog: ethers.providers.Log): void {}
 
   protected logLeverageEvent(): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:24:38
     this.setPositionAmountsFromEventLogData(eventLog);
   }
 
-  protected logLeverageEvent(): void {
-    const eventDetails: EventFetcherLogEntryMessage = {
-      event: this.eventName,
-      user: this.userAddress,
-      strategy: '',
-      depositAmount: this.receivedAmount.toString(),
-      borrowedAmount: this.debtAmount.toString(),
-    };
-
-    this.logger.info(JSON.stringify(eventDetails));
-  }
+  protected logLeverageEvent(): void {}
 
   private setNftIdFromEventLogTopic(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:36:75
     this.logger.info(JSON.stringify(eventDetails));
   }
 
-  private setNftIdFromEventLogTopic(eventLog: ethers.providers.Log): void {
-    this.nftId = Number(eventLog.topics[1]);
-  }
+  private setNftIdFromEventLogTopic(eventLog: ethers.providers.Log): void {}
 
   private setUserAddressFromEventLog(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:40:76
     this.nftId = Number(eventLog.topics[1]);
   }
 
-  private setUserAddressFromEventLog(eventLog: ethers.providers.Log): void {
-    const rawAddress = eventLog.topics[2];
-    const trimmedAddress = '0x' + rawAddress.slice(26);
-    this.userAddress = ethers.utils.getAddress(trimmedAddress);
-  }
+  private setUserAddressFromEventLog(eventLog: ethers.providers.Log): void {}
 
   private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] MethodExpression
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:42:35
 
   private setUserAddressFromEventLog(eventLog: ethers.providers.Log): void {
     const rawAddress = eventLog.topics[2];
-    const trimmedAddress = '0x' + rawAddress.slice(26);
+    const trimmedAddress = '0x' + rawAddress;
     this.userAddress = ethers.utils.getAddress(trimmedAddress);
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:42:28
 
   private setUserAddressFromEventLog(eventLog: ethers.providers.Log): void {
     const rawAddress = eventLog.topics[2];
-    const trimmedAddress = '0x' + rawAddress.slice(26);
+    const trimmedAddress = "" + rawAddress.slice(26);
     this.userAddress = ethers.utils.getAddress(trimmedAddress);
   }

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:46:84
     this.userAddress = ethers.utils.getAddress(trimmedAddress);
   }
 
-  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
-    const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256', 'uint256'],
-        eventLog.data);
-
-    this.receivedAmount = decodedData[0];
-    this.debtAmount = decodedData[1];
-  }
+  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {}
 
   protected getSQSMessage(): EventFetcherSQSMessage {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:55:53
     this.debtAmount = decodedData[1];
   }
 
-  protected getSQSMessage(): EventFetcherSQSMessage {
-    const msg: EventFetcherSQSMessage = {
-      name: 'PositionClosed',
-      contractType: 1,
-      txHash: this.txHash,
-      blockNumber: this.blockNumber,
-      data: {
-        nftId: this.nftId,
-        user: this.userAddress,
-        receivedAmount: this.receivedAmount.toString(),
-        wbtcDebtAmount: this.debtAmount.toString(),
-      },
-    };
-
-    return msg;
-  }
+  protected getSQSMessage(): EventFetcherSQSMessage {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionClosed.ts:57:13
 
   protected getSQSMessage(): EventFetcherSQSMessage {
     const msg: EventFetcherSQSMessage = {
-      name: 'PositionClosed',
+      name: "",
       contractType: 1,
       txHash: this.txHash,
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
