[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:11:120
 export class OnChainEventLeveragePositionExpired extends OnChainEventLeverage {
   private claimableAmount!: bigint;
 
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    super(rawEventLog, logger, sqsService, configService);
-    this.eventName = 'LeveragedPositionExpired';
-    this.parseEventLog(rawEventLog);
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   protected parseEventLog(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:17:65
     this.parseEventLog(rawEventLog);
   }
 
-  protected parseEventLog(eventLog: ethers.providers.Log): void {
-    this.setNftIdFromEventLogTopic(eventLog);
-    this.setUserAddressFromEventLog(eventLog);
-    this.setPositionAmountsFromEventLogData(eventLog);
-  }
+  protected parseEventLog(eventLog: ethers.providers.Log): void {}
 
   protected logLeverageEvent(): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:23:38
     this.setPositionAmountsFromEventLogData(eventLog);
   }
 
-  protected logLeverageEvent(): void {
-    const eventDetails: EventFetcherLogEntryMessage = {
-      event: this.eventName,
-      user: this.userAddress,
-      strategy: '',
-      depositAmount: this.claimableAmount.toString(),
-    };
-
-    this.logger.info(JSON.stringify(eventDetails));
-  }
+  protected logLeverageEvent(): void {}
 
   private setNftIdFromEventLogTopic(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:44:84
     this.userAddress = ethers.utils.getAddress(trimmedAddress);
   }
 
-  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
-    const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256'],
-        eventLog.data);
-
-    this.claimableAmount = decodedData[0];
-  }
+  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {}
 
   protected getSQSMessage(): EventFetcherSQSMessage {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:46:10
 
   private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
     const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256'],
+        [""],
         eventLog.data);
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArrayDeclaration
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:46:9
 
   private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
     const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256'],
+        [],
         eventLog.data);
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:52:53
     this.claimableAmount = decodedData[0];
   }
 
-  protected getSQSMessage(): EventFetcherSQSMessage {
-    const msg: EventFetcherSQSMessage = {
-      name: 'PositionExpired',
-      contractType: 3,
-      txHash: this.txHash,
-      blockNumber: this.blockNumber,
-      data: {
-        nftId: this.nftId,
-        user: this.userAddress,
-        claimableAmount: this.claimableAmount.toString(),
-      },
-    };
-
-    return msg;
-  }
+  protected getSQSMessage(): EventFetcherSQSMessage {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionExpired.ts:54:13
 
   protected getSQSMessage(): EventFetcherSQSMessage {
     const msg: EventFetcherSQSMessage = {
-      name: 'PositionExpired',
+      name: "",
       contractType: 3,
       txHash: this.txHash,
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
