[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:13:120
   private claimableAmount!: bigint;
   private liquidationFee!: bigint;
 
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    super(rawEventLog, logger, sqsService, configService);
-    this.eventName = 'LeveragedPositionLiquidated';
-    this.parseEventLog(rawEventLog);
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   protected parseEventLog(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:19:65
     this.parseEventLog(rawEventLog);
   }
 
-  protected parseEventLog(eventLog: ethers.providers.Log): void {
-    this.setNftIdFromEventLogTopic(eventLog);
-    this.setStrategyConfigFromEventLogTopic(eventLog);
-    this.setPositionAmountsFromEventLogData(eventLog);
-
-    this.userAddress = '0';
-  }
+  protected parseEventLog(eventLog: ethers.providers.Log): void {}
 
   protected logLeverageEvent(): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:27:38
     this.userAddress = '0';
   }
 
-  protected logLeverageEvent(): void {
-    const eventDetails: EventFetcherLogEntryMessage = {
-      event: this.eventName,
-      user: this.userAddress,
-      strategy: this.strategyConfig.strategyName,
-      depositAmount: this.claimableAmount.toString(),
-      borrowedAmount: this.liquidationFee.toString(),
-    };
-
-    this.logger.info(JSON.stringify(eventDetails));
-  }
+  protected logLeverageEvent(): void {}
 
   private setNftIdFromEventLogTopic(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:43:84
     this.nftId = Number(eventLog.topics[1]);
   }
 
-  private setStrategyConfigFromEventLogTopic(eventLog: ethers.providers.Log): void {
-    const rawAddress = eventLog.topics[2];
-    const trimmedAddress = '0x' + rawAddress.slice(26);
-    const strategyAddress = ethers.utils.getAddress(trimmedAddress);
-
-    this.strategyConfig = this.findStrategyConfigBStrategyAddress(strategyAddress);
-  }
+  private setStrategyConfigFromEventLogTopic(eventLog: ethers.providers.Log): void {}
 
   private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:51:84
     this.strategyConfig = this.findStrategyConfigBStrategyAddress(strategyAddress);
   }
 
-  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
-    const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256', 'uint256', 'uint256'],
-        eventLog.data);
-
-    this.debtPaid = decodedData[0];
-    this.claimableAmount = decodedData[1];
-    this.liquidationFee = decodedData[2];
-  }
+  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {}
 
   protected getSQSMessage(): EventFetcherSQSMessage {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:53:21
 
   private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
     const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256', 'uint256', 'uint256'],
+        ['uint256', "", 'uint256'],
         eventLog.data);
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:61:53
     this.liquidationFee = decodedData[2];
   }
 
-  protected getSQSMessage(): EventFetcherSQSMessage {
-    const msg: EventFetcherSQSMessage = {
-      name: 'PositionLiquidated',
-      contractType: 2,
-      txHash: this.txHash,
-      blockNumber: this.blockNumber,
-      data: {
-        nftId: this.nftId,
-        strategy: this.strategyConfig.strategyAddress,
-        wbtcDebtPaid: this.debtPaid.toString(),
-        claimableAmount: this.claimableAmount.toString(),
-        liquidationFee: this.liquidationFee.toString(),
-      },
-    };
-
-    return msg;
-  }
+  protected getSQSMessage(): EventFetcherSQSMessage {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionLiquidated.ts:63:13
 
   protected getSQSMessage(): EventFetcherSQSMessage {
     const msg: EventFetcherSQSMessage = {
-      name: 'PositionLiquidated',
+      name: "",
       contractType: 2,
       txHash: this.txHash,
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
