[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:14:120
   private positionExpireBlock!: number;
   private sharesReceived!: bigint;
 
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    super(rawEventLog, logger, sqsService, configService);
-    this.eventName = 'LeveragedPositionOpened';
-    this.parseEventLog(rawEventLog);
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   protected parseEventLog(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:16:22
 
   constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
     super(rawEventLog, logger, sqsService, configService);
-    this.eventName = 'LeveragedPositionOpened';
+    this.eventName = "";
     this.parseEventLog(rawEventLog);
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:20:65
     this.parseEventLog(rawEventLog);
   }
 
-  protected parseEventLog(eventLog: ethers.providers.Log): void {
-    this.setUserAddressFromEventLog(eventLog);
-    this.setStrategyConfigFromEventLogTopic(eventLog);
-    this.setNftIdFromEventLogTopic(eventLog);
-
-    this.setPositionAmountsFromEventLogData(eventLog);
-  }
+  protected parseEventLog(eventLog: ethers.providers.Log): void {}
 
   protected logLeverageEvent(): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:28:38
     this.setPositionAmountsFromEventLogData(eventLog);
   }
 
-  protected logLeverageEvent(): void {
-    const eventDetails: EventFetcherLogEntryMessage = {
-      event: this.eventName,
-      user: this.userAddress,
-      strategy: this.strategyConfig.strategyName,
-      depositAmount: this.collateralAmount.toString(),
-      borrowedAmount: this.borrowedAmount.toString(),
-    };
-
-    this.logger.info(JSON.stringify(eventDetails));
-  }
+  protected logLeverageEvent(): void {}
 
   private setNftIdFromEventLogTopic(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:44:84
     this.nftId = Number(eventLog.topics[1]);
   }
 
-  private setStrategyConfigFromEventLogTopic(eventLog: ethers.providers.Log): void {
-    const rawAddress = eventLog.topics[3];
-    const trimmedAddress = '0x' + rawAddress.slice(26);
-    const strategyAddress = ethers.utils.getAddress(trimmedAddress);
-
-    this.strategyConfig = this.findStrategyConfigBStrategyAddress(strategyAddress);
-  }
+  private setStrategyConfigFromEventLogTopic(eventLog: ethers.providers.Log): void {}
 
   private setUserAddressFromEventLog(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] MethodExpression
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:46:35
 
   private setStrategyConfigFromEventLogTopic(eventLog: ethers.providers.Log): void {
     const rawAddress = eventLog.topics[3];
-    const trimmedAddress = '0x' + rawAddress.slice(26);
+    const trimmedAddress = '0x' + rawAddress;
     const strategyAddress = ethers.utils.getAddress(trimmedAddress);
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:58:84
     this.userAddress = ethers.utils.getAddress(trimmedAddress);
   }
 
-  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
-    const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256', 'uint256', 'uint256', 'uint256'],
-        eventLog.data);
-
-    this.collateralAmount = decodedData[0];
-    this.borrowedAmount = decodedData[1];
-    this.positionExpireBlock = decodedData[2];
-    this.sharesReceived = decodedData[3];
-  }
+  private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {}
 
   protected getSQSMessage(): EventFetcherSQSMessage {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:60:43
 
   private setPositionAmountsFromEventLogData(eventLog: ethers.providers.Log): void {
     const decodedData = ethers.utils.defaultAbiCoder.decode(
-        ['uint256', 'uint256', 'uint256', 'uint256'],
+        ['uint256', 'uint256', 'uint256', ""],
         eventLog.data);
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:69:53
     this.sharesReceived = decodedData[3];
   }
 
-  protected getSQSMessage(): EventFetcherSQSMessage {
-    const msg: EventFetcherSQSMessage = {
-      name: 'PositionOpened',
-      contractType: 0,
-      txHash: this.txHash,
-      blockNumber: this.blockNumber,
-      data: {
-        nftId: this.nftId,
-        user: this.userAddress,
-        strategy: this.strategyConfig.strategyAddress,
-        collateralAmount: this.collateralAmount.toString(),
-        wbtcToBorrow: this.borrowedAmount.toString(),
-        positionExpireBlock: this.positionExpireBlock.toString(),
-        sharesReceived: this.sharesReceived.toString(),
-      },
-    };
-
-    return msg;
-  }
+  protected getSQSMessage(): EventFetcherSQSMessage {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ObjectLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:70:41
   }
 
   protected getSQSMessage(): EventFetcherSQSMessage {
-    const msg: EventFetcherSQSMessage = {
-      name: 'PositionOpened',
-      contractType: 0,
-      txHash: this.txHash,
-      blockNumber: this.blockNumber,
-      data: {
-        nftId: this.nftId,
-        user: this.userAddress,
-        strategy: this.strategyConfig.strategyAddress,
-        collateralAmount: this.collateralAmount.toString(),
-        wbtcToBorrow: this.borrowedAmount.toString(),
-        positionExpireBlock: this.positionExpireBlock.toString(),
-        sharesReceived: this.sharesReceived.toString(),
-      },
-    };
+    const msg: EventFetcherSQSMessage = {};
 
     return msg;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ObjectLiteral
src/onchain_events/leverage_events/OnChainEventLeveragePositionOpened.ts:75:13
       contractType: 0,
       txHash: this.txHash,
       blockNumber: this.blockNumber,
-      data: {
-        nftId: this.nftId,
-        user: this.userAddress,
-        strategy: this.strategyConfig.strategyAddress,
-        collateralAmount: this.collateralAmount.toString(),
-        wbtcToBorrow: this.borrowedAmount.toString(),
-        positionExpireBlock: this.positionExpireBlock.toString(),
-        sharesReceived: this.sharesReceived.toString(),
-      },
+      data: {},
     };
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
