[Killed] BlockStatement
src/onchain_events/psp_events/OnChainEventPSP.ts:8:120
 import {ConfigService} from '../../services/config/ConfigService';
 
 export abstract class OnChainEventPSP extends OnChainEvent {
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    super(rawEventLog, logger, sqsService, configService);
-    this.parseEventLog(rawEventLog);
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   public process(): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/psp_events/OnChainEventPSP.ts:13:26
     this.parseEventLog(rawEventLog);
   }
 
-  public process(): void {
-    this.logPSPEvent();
-  }
+  public process(): void {}
 
   protected abstract logPSPEvent(): void;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/psp_events/OnChainEventPSP.ts:19:65
 
   protected abstract logPSPEvent(): void;
 
-  protected parseEventLog(eventLog: ethers.providers.Log): void {
-    this.setUserAddressFromEventLog(eventLog);
-    this.setAmountFromEventLogData(eventLog);
-    this.strategyConfig = this.findStrategyConfigBStrategyAddress(eventLog.address);
-  }
+  protected parseEventLog(eventLog: ethers.providers.Log): void {}
 
   protected abstract setAmountFromEventLogData(eventLog: ethers.providers.Log): void
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
