[Killed] BlockStatement
src/onchain_events/psp_events/OnChainEventPSPWithdraw.ts:10:120
 export class OnChainEventPSPWithdraw extends OnChainEventPSP {
   private withdrawAmount!: bigint;
 
-  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {
-    super(rawEventLog, logger, sqsService, configService);
-    this.eventName = 'Withdraw';
-  }
+  constructor(rawEventLog: ethers.providers.Log, logger: Logger, sqsService: SQSService, configService: ConfigService) {}
 
   protected logPSPEvent(): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/psp_events/OnChainEventPSPWithdraw.ts:15:33
     this.eventName = 'Withdraw';
   }
 
-  protected logPSPEvent(): void {
-    const eventDetails: EventFetcherLogEntryMessage = {
-      event: this.eventName,
-      user: this.userAddress,
-      strategy: this.strategyConfig.strategyName,
-      depositAmount: this.withdrawAmount.toString(),
-    };
-
-    this.logger.info(JSON.stringify(eventDetails));
-  }
+  protected logPSPEvent(): void {}
 
   protected setAmountFromEventLogData(eventLog: ethers.providers.Log): void {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/onchain_events/psp_events/OnChainEventPSPWithdraw.ts:26:77
     this.logger.info(JSON.stringify(eventDetails));
   }
 
-  protected setAmountFromEventLogData(eventLog: ethers.providers.Log): void {
-    this.withdrawAmount = BigInt((ethers.utils.defaultAbiCoder.decode(['uint256', 'uint256'], eventLog.data))[0]);
-  }
+  protected setAmountFromEventLogData(eventLog: ethers.providers.Log): void {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
