[Killed] BlockStatement
src/services/blockchain/EventFetcher.ts:10:109
         topics: string[]
     ): Promise<ethers.providers.Log[]>;
 
-    protected dedupLogsBasedOnTxHashLogIndexAndTopic0(logs: ethers.providers.Log[]): ethers.providers.Log[] {
-      const uniqueLogs = new Map<string, ethers.providers.Log>();
-
-      for (const log of logs) {
-        const uniqueKey = log.transactionHash + log.logIndex + log.topics[0];
-        if (!uniqueLogs.has(uniqueKey)) {
-          uniqueLogs.set(uniqueKey, log);
-        }
-      }
-
-      const res = Array.from(uniqueLogs.values());
-      return res;
-    }
+    protected dedupLogsBasedOnTxHashLogIndexAndTopic0(logs: ethers.providers.Log[]): ethers.providers.Log[] {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/blockchain/EventFetcher.ts:13:31
     protected dedupLogsBasedOnTxHashLogIndexAndTopic0(logs: ethers.providers.Log[]): ethers.providers.Log[] {
       const uniqueLogs = new Map<string, ethers.providers.Log>();
 
-      for (const log of logs) {
-        const uniqueKey = log.transactionHash + log.logIndex + log.topics[0];
-        if (!uniqueLogs.has(uniqueKey)) {
-          uniqueLogs.set(uniqueKey, log);
-        }
-      }
+      for (const log of logs) {}
 
       const res = Array.from(uniqueLogs.values());
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] ArithmeticOperator
src/services/blockchain/EventFetcher.ts:14:27
       const uniqueLogs = new Map<string, ethers.providers.Log>();
 
       for (const log of logs) {
-        const uniqueKey = log.transactionHash + log.logIndex + log.topics[0];
+        const uniqueKey = log.transactionHash + log.logIndex - log.topics[0];
         if (!uniqueLogs.has(uniqueKey)) {
           uniqueLogs.set(uniqueKey, log);

[Survived] ArithmeticOperator
src/services/blockchain/EventFetcher.ts:14:27
       const uniqueLogs = new Map<string, ethers.providers.Log>();
 
       for (const log of logs) {
-        const uniqueKey = log.transactionHash + log.logIndex + log.topics[0];
+        const uniqueKey = log.transactionHash - log.logIndex + log.topics[0];
         if (!uniqueLogs.has(uniqueKey)) {
           uniqueLogs.set(uniqueKey, log);

[Killed] BlockStatement
src/services/blockchain/EventFetcher.ts:15:41
 
       for (const log of logs) {
         const uniqueKey = log.transactionHash + log.logIndex + log.topics[0];
-        if (!uniqueLogs.has(uniqueKey)) {
-          uniqueLogs.set(uniqueKey, log);
-        }
+        if (!uniqueLogs.has(uniqueKey)) {}
       }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BooleanLiteral
src/services/blockchain/EventFetcher.ts:15:13
 
       for (const log of logs) {
         const uniqueKey = log.transactionHash + log.logIndex + log.topics[0];
-        if (!uniqueLogs.has(uniqueKey)) {
+        if (uniqueLogs.has(uniqueKey)) {
           uniqueLogs.set(uniqueKey, log);
         }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
