[Killed] BlockStatement
src/services/blockchain/EventFetcherRPC.ts:9:70
   private readonly mainProvider: ethers.providers.Provider;
   private readonly altProvider: ethers.providers.Provider;
 
-  constructor(mainProviderRPCURL: string, altProviderRPCURL: string) {
-    super();
-    this.mainProvider = new ethers.providers.JsonRpcProvider(mainProviderRPCURL);
-    this.altProvider = new ethers.providers.JsonRpcProvider(altProviderRPCURL);
-  }
+  constructor(mainProviderRPCURL: string, altProviderRPCURL: string) {}
 
   public async getOnChainEvents(blockNumberFrom: number,
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/blockchain/EventFetcherRPC.ts:18:38
   public async getOnChainEvents(blockNumberFrom: number,
       blockNumberTo: number,
       topics: string[],
-  ): Promise<ethers.providers.Log[]> {
-    const filter: ethers.providers.Filter = {
-      topics: topics,
-      fromBlock: blockNumberFrom,
-      toBlock: blockNumberTo,
-    };
-
-    const logs = await this.fetchLogsFromBlockchain(filter);
-    return logs;
-  }
+  ): Promise<ethers.providers.Log[]> {}
 
   public async getCurrentBlockNumber(): Promise<number> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/blockchain/EventFetcherRPC.ts:29:57
     return logs;
   }
 
-  public async getCurrentBlockNumber(): Promise<number> {
-    const [mainBlockNumber, altBlockNumber] = await Promise.all([
-      this.mainProvider.getBlockNumber(),
-      this.altProvider.getBlockNumber(),
-    ]);
-
-    return Math.min(mainBlockNumber, altBlockNumber);
-  }
+  public async getCurrentBlockNumber(): Promise<number> {}
 
   private async fetchLogsFromBlockchain(
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] MethodExpression
src/services/blockchain/EventFetcherRPC.ts:35:12
       this.altProvider.getBlockNumber(),
     ]);
 
-    return Math.min(mainBlockNumber, altBlockNumber);
+    return Math.max(mainBlockNumber, altBlockNumber);
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/blockchain/EventFetcherRPC.ts:40:38
 
   private async fetchLogsFromBlockchain(
       filter: ethers.providers.Filter,
-  ): Promise<ethers.providers.Log[]> {
-    const [alchemyLogs, infuraLogs] = await Promise.all([
-      this.mainProvider.getLogs(filter),
-      this.altProvider.getLogs(filter),
-    ]);
-
-    return this.dedupLogsBasedOnTxHashLogIndexAndTopic0([...alchemyLogs, ...infuraLogs]);
-  }
+  ): Promise<ethers.providers.Log[]> {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArrayDeclaration
src/services/blockchain/EventFetcherRPC.ts:41:57
   private async fetchLogsFromBlockchain(
       filter: ethers.providers.Filter,
   ): Promise<ethers.providers.Log[]> {
-    const [alchemyLogs, infuraLogs] = await Promise.all([
-      this.mainProvider.getLogs(filter),
-      this.altProvider.getLogs(filter),
-    ]);
+    const [alchemyLogs, infuraLogs] = await Promise.all([]);
 
     return this.dedupLogsBasedOnTxHashLogIndexAndTopic0([...alchemyLogs, ...infuraLogs]);
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
