[Killed] BlockStatement
src/services/config/AppConfigClient.ts:8:52
   private readonly environment: string;
   private readonly clientId: string = 'EventFetcherService';
 
-  constructor(environment: string, region: string) {
-    this.appConfigClient = new AppConfig({region: region});
-    this.environment = environment;
-  }
+  constructor(environment: string, region: string) {}
 
   public async fetchConfigRawString(configName: string): Promise<string> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] ObjectLiteral
src/services/config/AppConfigClient.ts:9:42
   private readonly clientId: string = 'EventFetcherService';
 
   constructor(environment: string, region: string) {
-    this.appConfigClient = new AppConfig({region: region});
+    this.appConfigClient = new AppConfig({});
     this.environment = environment;
   }

[Killed] BlockStatement
src/services/config/AppConfigClient.ts:13:74
     this.environment = environment;
   }
 
-  public async fetchConfigRawString(configName: string): Promise<string> {
-    try {
-      const response = await this.getConfigFromAppConfig(configName);
-      return response;
-    } catch (error) {
-      throw new Error(`Error fetching configuration for ${configName}: ${error}`);
-    }
-  }
+  public async fetchConfigRawString(configName: string): Promise<string> {}
 
   private async getConfigFromAppConfig(configName: string): Promise<string> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/AppConfigClient.ts:14:9
   }
 
   public async fetchConfigRawString(configName: string): Promise<string> {
-    try {
-      const response = await this.getConfigFromAppConfig(configName);
-      return response;
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(`Error fetching configuration for ${configName}: ${error}`);
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] BlockStatement
src/services/config/AppConfigClient.ts:17:21
     try {
       const response = await this.getConfigFromAppConfig(configName);
       return response;
-    } catch (error) {
-      throw new Error(`Error fetching configuration for ${configName}: ${error}`);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/services/config/AppConfigClient.ts:22:77
     }
   }
 
-  private async getConfigFromAppConfig(configName: string): Promise<string> {
-    const params = {
-      Application: this.environment,
-      Configuration: configName,
-      Environment: this.environment,
-      ClientId: this.clientId,
-    };
-
-    const response: GetConfigurationCommandOutput = await this.appConfigClient.getConfiguration(params);
-
-    if (response.Content) {
-      return Buffer.from(response.Content).toString('utf-8');
-    } else {
-      throw new Error(`Configuration ${configName} not found or is empty.`);
-    }
-  }
+  private async getConfigFromAppConfig(configName: string): Promise<string> {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/AppConfigClient.ts:32:27
 
     const response: GetConfigurationCommandOutput = await this.appConfigClient.getConfiguration(params);
 
-    if (response.Content) {
-      return Buffer.from(response.Content).toString('utf-8');
-    } else {
+    if (response.Content) {} else {
       throw new Error(`Configuration ${configName} not found or is empty.`);
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/AppConfigClient.ts:32:9
 
     const response: GetConfigurationCommandOutput = await this.appConfigClient.getConfiguration(params);
 
-    if (response.Content) {
+    if (false) {
       return Buffer.from(response.Content).toString('utf-8');
     } else {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] BlockStatement
src/services/config/AppConfigClient.ts:34:12
 
     if (response.Content) {
       return Buffer.from(response.Content).toString('utf-8');
-    } else {
-      throw new Error(`Configuration ${configName} not found or is empty.`);
-    }
+    } else {}
   }
 }
