[Killed] StringLiteral
src/services/config/ConfigService.ts:11:35
 }
 
 export abstract class ConfigService {
-  protected environment: string = '';
+  protected environment: string = "Stryker was here!";
   protected leverageContractAddresses!: LeverageContractAddresses;
   protected pspContractInfo: ContractInfoPSP[] = [];
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Survived] StringLiteral
src/services/config/ConfigService.ts:16:33
   protected pspContractInfo: ContractInfoPSP[] = [];
   protected lastBlockScanned: number = 0;
   protected MainRPCURL: string = '';
-  protected AltRPCURL: string = '';
+  protected AltRPCURL: string = "Stryker was here!";
   protected EventFetchPageSize: number = 0;
   protected EventQueueURL: string = '';

[Killed] BlockStatement
src/services/config/ConfigService.ts:24:35
   abstract refreshConfig(): Promise<void>;
   abstract setLastScannedBlock(blockNumber: number): Promise<void>;
 
-  public getEnvironment(): string {
-    return this.environment;
-  }
+  public getEnvironment(): string {}
 
   public getLeveragePositionOpenerAddress(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:28:53
     return this.environment;
   }
 
-  public getLeveragePositionOpenerAddress(): string {
-    return this.leverageContractAddresses.positionOpenerAddress;
-  }
+  public getLeveragePositionOpenerAddress(): string {}
 
   public getLeveragePositionLiquidatorAddress(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:32:57
     return this.leverageContractAddresses.positionOpenerAddress;
   }
 
-  public getLeveragePositionLiquidatorAddress(): string {
-    return this.leverageContractAddresses.positionLiquidatorAddress;
-  }
+  public getLeveragePositionLiquidatorAddress(): string {}
 
   public getLeveragePositionCloserAddress(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:36:53
     return this.leverageContractAddresses.positionLiquidatorAddress;
   }
 
-  public getLeveragePositionCloserAddress(): string {
-    return this.leverageContractAddresses.positionCloserAddress;
-  }
+  public getLeveragePositionCloserAddress(): string {}
 
   public getLeveragePositionExpiratorAddress(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:40:56
     return this.leverageContractAddresses.positionCloserAddress;
   }
 
-  public getLeveragePositionExpiratorAddress(): string {
-    return this.leverageContractAddresses.positionExpiratorAddress;
-  }
+  public getLeveragePositionExpiratorAddress(): string {}
 
   public getPSPContractAddressByStrategyName(strategyName: string): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:44:76
     return this.leverageContractAddresses.positionExpiratorAddress;
   }
 
-  public getPSPContractAddressByStrategyName(strategyName: string): string {
-    const contract = this.pspContractInfo.find((contract: { strategyName: string; }) =>
-      contract.strategyName === strategyName,
-    );
-
-    return contract?.strategyAddress || '';
-  }
+  public getPSPContractAddressByStrategyName(strategyName: string): string {}
 
   public getPSPStrategyInfoByAddress(strategyAddress: string): ContractInfoPSP | undefined {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArrowFunction
src/services/config/ConfigService.ts:45:48
   }
 
   public getPSPContractAddressByStrategyName(strategyName: string): string {
-    const contract = this.pspContractInfo.find((contract: { strategyName: string; }) =>
-      contract.strategyName === strategyName,
+    const contract = this.pspContractInfo.find(() => undefined,
     );
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/services/config/ConfigService.ts:46:7
 
   public getPSPContractAddressByStrategyName(strategyName: string): string {
     const contract = this.pspContractInfo.find((contract: { strategyName: string; }) =>
-      contract.strategyName === strategyName,
+      contract.strategyName !== strategyName,
     );
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigService.ts:46:7
 
   public getPSPContractAddressByStrategyName(strategyName: string): string {
     const contract = this.pspContractInfo.find((contract: { strategyName: string; }) =>
-      contract.strategyName === strategyName,
+      false,
     );
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigService.ts:49:12
       contract.strategyName === strategyName,
     );
 
-    return contract?.strategyAddress || '';
+    return true;
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigService.ts:49:12
       contract.strategyName === strategyName,
     );
 
-    return contract?.strategyAddress || '';
+    return false;
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:52:92
     return contract?.strategyAddress || '';
   }
 
-  public getPSPStrategyInfoByAddress(strategyAddress: string): ContractInfoPSP | undefined {
-    return this.pspContractInfo.find((contract: { strategyAddress: string; }) =>
-      contract.strategyAddress === strategyAddress,
-    );
-  }
+  public getPSPStrategyInfoByAddress(strategyAddress: string): ContractInfoPSP | undefined {}
 
   public getPSPStrategyCount(): number {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArrowFunction
src/services/config/ConfigService.ts:53:38
   }
 
   public getPSPStrategyInfoByAddress(strategyAddress: string): ContractInfoPSP | undefined {
-    return this.pspContractInfo.find((contract: { strategyAddress: string; }) =>
-      contract.strategyAddress === strategyAddress,
+    return this.pspContractInfo.find(() => undefined,
     );
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigService.ts:54:7
 
   public getPSPStrategyInfoByAddress(strategyAddress: string): ContractInfoPSP | undefined {
     return this.pspContractInfo.find((contract: { strategyAddress: string; }) =>
-      contract.strategyAddress === strategyAddress,
+      true,
     );
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] EqualityOperator
src/services/config/ConfigService.ts:54:7
 
   public getPSPStrategyInfoByAddress(strategyAddress: string): ContractInfoPSP | undefined {
     return this.pspContractInfo.find((contract: { strategyAddress: string; }) =>
-      contract.strategyAddress === strategyAddress,
+      contract.strategyAddress !== strategyAddress,
     );
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:58:40
     );
   }
 
-  public getPSPStrategyCount(): number {
-    return this.pspContractInfo.length;
-  }
+  public getPSPStrategyCount(): number {}
 
   public getLastBlockScanned(): number {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:62:40
     return this.pspContractInfo.length;
   }
 
-  public getLastBlockScanned(): number {
-    return this.lastBlockScanned;
-  }
+  public getLastBlockScanned(): number {}
 
   public getMainRPCURL(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:66:34
     return this.lastBlockScanned;
   }
 
-  public getMainRPCURL(): string {
-    return this.MainRPCURL;
-  }
+  public getMainRPCURL(): string {}
 
   public getAlternativeRPCURL(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:70:41
     return this.MainRPCURL;
   }
 
-  public getAlternativeRPCURL(): string {
-    return this.AltRPCURL;
-  }
+  public getAlternativeRPCURL(): string {}
 
   public getEventsFetchPageSize(): number {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:74:43
     return this.AltRPCURL;
   }
 
-  public getEventsFetchPageSize(): number {
-    return this.EventFetchPageSize;
-  }
+  public getEventsFetchPageSize(): number {}
 
   public getEventQueueURL(): string {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:78:37
     return this.EventFetchPageSize;
   }
 
-  public getEventQueueURL(): string {
-    return this.EventQueueURL;
-  }
+  public getEventQueueURL(): string {}
 
   public getMaxNumberOfBlocksToProcess(): number {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigService.ts:82:50
     return this.EventQueueURL;
   }
 
-  public getMaxNumberOfBlocksToProcess(): number {
-    return this.MaxNumberOfBlocksToProess;
-  }
+  public getMaxNumberOfBlocksToProcess(): number {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
