[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:17:47
     this.appConfigClient = new AppConfigClient(environment, region);
   }
 
-  public async refreshConfig(): Promise<void> {
-    await Promise.all([
-      this.refreshLeverageContractAddresses(),
-      this.refreshPSPContractInfo(),
-      this.refreshLastScannedBlock(),
-      this.refreshRPCURL(),
-      this.refreshEventFetchPageSize(),
-      this.refreshEventQueueURL(),
-    ]);
-  }
+  public async refreshConfig(): Promise<void> {}
 
   public async setLastScannedBlock(blockNumber: number): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ArrayDeclaration
src/services/config/ConfigServiceAWS.ts:18:23
   }
 
   public async refreshConfig(): Promise<void> {
-    await Promise.all([
-      this.refreshLeverageContractAddresses(),
-      this.refreshPSPContractInfo(),
-      this.refreshLastScannedBlock(),
-      this.refreshRPCURL(),
-      this.refreshEventFetchPageSize(),
-      this.refreshEventQueueURL(),
-    ]);
+    await Promise.all([]);
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:28:72
     ]);
   }
 
-  public async setLastScannedBlock(blockNumber: number): Promise<void> {
-    const res = JSON.parse(await this.appConfigClient.fetchConfigRawString('LastBlockScannedS3FileURL'));
-    await this.s3Service.putObject(res['bucket'], res['key'], blockNumber.toString());
-    this.lastBlockScanned = blockNumber;
-  }
+  public async setLastScannedBlock(blockNumber: number): Promise<void> {}
 
   public async refreshLeverageContractAddresses(): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/services/config/ConfigServiceAWS.ts:30:55
 
   public async setLastScannedBlock(blockNumber: number): Promise<void> {
     const res = JSON.parse(await this.appConfigClient.fetchConfigRawString('LastBlockScannedS3FileURL'));
-    await this.s3Service.putObject(res['bucket'], res['key'], blockNumber.toString());
+    await this.s3Service.putObject(res['bucket'], res[""], blockNumber.toString());
     this.lastBlockScanned = blockNumber;
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:34:66
     this.lastBlockScanned = blockNumber;
   }
 
-  public async refreshLeverageContractAddresses(): Promise<void> {
-    try {
-      const leverageContractInfo = await this.fetchLeverageContractInfo();
-      this.leverageContractAddresses = this.extractLeverageContractAddresses(leverageContractInfo);
-    } catch (error) {
-      console.error('Failed to refresh leverage contract addresses:', error);
-      throw error;
-    }
-  }
+  public async refreshLeverageContractAddresses(): Promise<void> {}
 
   private async fetchLeverageContractInfo(): Promise<ContractInfoLeverage[]> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:35:9
   }
 
   public async refreshLeverageContractAddresses(): Promise<void> {
-    try {
-      const leverageContractInfo = await this.fetchLeverageContractInfo();
-      this.leverageContractAddresses = this.extractLeverageContractAddresses(leverageContractInfo);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Failed to refresh leverage contract addresses:', error);
       throw error;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:38:21
     try {
       const leverageContractInfo = await this.fetchLeverageContractInfo();
       this.leverageContractAddresses = this.extractLeverageContractAddresses(leverageContractInfo);
-    } catch (error) {
-      console.error('Failed to refresh leverage contract addresses:', error);
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/services/config/ConfigServiceAWS.ts:39:21
       const leverageContractInfo = await this.fetchLeverageContractInfo();
       this.leverageContractAddresses = this.extractLeverageContractAddresses(leverageContractInfo);
     } catch (error) {
-      console.error('Failed to refresh leverage contract addresses:', error);
+      console.error("", error);
       throw error;
     }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:44:78
     }
   }
 
-  private async fetchLeverageContractInfo(): Promise<ContractInfoLeverage[]> {
-    const configString = await this.appConfigClient.fetchConfigRawString('LeverageContractInfo');
-    return JSON.parse(configString);
-  }
+  private async fetchLeverageContractInfo(): Promise<ContractInfoLeverage[]> {}
 
   private extractLeverageContractAddresses(contracts: ContractInfoLeverage[]): LeverageContractAddresses {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ObjectLiteral
src/services/config/ConfigServiceAWS.ts:50:50
   }
 
   private extractLeverageContractAddresses(contracts: ContractInfoLeverage[]): LeverageContractAddresses {
-    const addresses: LeverageContractAddresses = {
-      positionOpenerAddress: '',
-      positionLiquidatorAddress: '',
-      positionCloserAddress: '',
-      positionExpiratorAddress: '',
-    };
+    const addresses: LeverageContractAddresses = {};
 
     contracts.forEach((contract) => {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/services/config/ConfigServiceAWS.ts:51:30
 
   private extractLeverageContractAddresses(contracts: ContractInfoLeverage[]): LeverageContractAddresses {
     const addresses: LeverageContractAddresses = {
-      positionOpenerAddress: '',
+      positionOpenerAddress: "Stryker was here!",
       positionLiquidatorAddress: '',
       positionCloserAddress: '',
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:57:37
       positionExpiratorAddress: '',
     };
 
-    contracts.forEach((contract) => {
-      switch (contract.name) {
-        case 'PositionOpener':
-          addresses.positionOpenerAddress = contract.address;
-          break;
-        case 'PositionLiquidator':
-          addresses.positionLiquidatorAddress = contract.address;
-          break;
-        case 'PositionCloser':
-          addresses.positionCloserAddress = contract.address;
-          break;
-        case 'positionExpirator':
-          addresses.positionExpiratorAddress = contract.address;
-          break;
-      }
-    });
+    contracts.forEach((contract) => {});
 
     return addresses;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigServiceAWS.ts:59:9
 
     contracts.forEach((contract) => {
       switch (contract.name) {
-        case 'PositionOpener':
-          addresses.positionOpenerAddress = contract.address;
-          break;
+        case 'PositionOpener':
         case 'PositionLiquidator':
           addresses.positionLiquidatorAddress = contract.address;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigServiceAWS.ts:62:9
         case 'PositionOpener':
           addresses.positionOpenerAddress = contract.address;
           break;
-        case 'PositionLiquidator':
-          addresses.positionLiquidatorAddress = contract.address;
-          break;
+        case 'PositionLiquidator':
         case 'PositionCloser':
           addresses.positionCloserAddress = contract.address;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/services/config/ConfigServiceAWS.ts:62:14
         case 'PositionOpener':
           addresses.positionOpenerAddress = contract.address;
           break;
-        case 'PositionLiquidator':
+        case "":
           addresses.positionLiquidatorAddress = contract.address;
           break;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigServiceAWS.ts:65:9
         case 'PositionLiquidator':
           addresses.positionLiquidatorAddress = contract.address;
           break;
-        case 'PositionCloser':
-          addresses.positionCloserAddress = contract.address;
-          break;
+        case 'PositionCloser':
         case 'positionExpirator':
           addresses.positionExpiratorAddress = contract.address;
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] ConditionalExpression
src/services/config/ConfigServiceAWS.ts:68:9
         case 'PositionCloser':
           addresses.positionCloserAddress = contract.address;
           break;
-        case 'positionExpirator':
-          addresses.positionExpiratorAddress = contract.address;
-          break;
+        case 'positionExpirator':
       }
     });
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:77:57
     return addresses;
   }
 
-  private async refreshPSPContractInfo(): Promise<void> {
-    const res = await this.appConfigClient.fetchConfigRawString('PSPStrategyInfo');
-    this.pspContractInfo = JSON.parse(res) as unknown as ContractInfoPSP[];
-  }
+  private async refreshPSPContractInfo(): Promise<void> {}
 
   private async refreshLastScannedBlock(): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/services/config/ConfigServiceAWS.ts:78:65
   }
 
   private async refreshPSPContractInfo(): Promise<void> {
-    const res = await this.appConfigClient.fetchConfigRawString('PSPStrategyInfo');
+    const res = await this.appConfigClient.fetchConfigRawString("");
     this.pspContractInfo = JSON.parse(res) as unknown as ContractInfoPSP[];
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:82:58
     this.pspContractInfo = JSON.parse(res) as unknown as ContractInfoPSP[];
   }
 
-  private async refreshLastScannedBlock(): Promise<void> {
-    const res = JSON.parse(await this.appConfigClient.fetchConfigRawString('LastBlockScannedS3FileURL'));
-    const blockNumber = await this.s3Service.getObject(res['bucket'], res['key']);
-    this.lastBlockScanned = parseInt(blockNumber, 10);
-  }
+  private async refreshLastScannedBlock(): Promise<void> {}
 
   private async refreshRPCURL(): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] StringLiteral
src/services/config/ConfigServiceAWS.ts:84:60
 
   private async refreshLastScannedBlock(): Promise<void> {
     const res = JSON.parse(await this.appConfigClient.fetchConfigRawString('LastBlockScannedS3FileURL'));
-    const blockNumber = await this.s3Service.getObject(res['bucket'], res['key']);
+    const blockNumber = await this.s3Service.getObject(res[""], res['key']);
     this.lastBlockScanned = parseInt(blockNumber, 10);
   }
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:88:48
     this.lastBlockScanned = parseInt(blockNumber, 10);
   }
 
-  private async refreshRPCURL(): Promise<void> {
-    const [mainRPCURL, altRPCURL] = await Promise.all([
-      this.appConfigClient.fetchConfigRawString('RpcUrl'),
-      this.appConfigClient.fetchConfigRawString('AltRpcUrl'),
-    ]);
-
-    this.MainRPCURL = mainRPCURL;
-    this.AltRPCURL = altRPCURL;
-  }
+  private async refreshRPCURL(): Promise<void> {}
 
   private async refreshEventFetchPageSize(): Promise<void> {
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions

[Timeout] BlockStatement
src/services/config/ConfigServiceAWS.ts:98:60
     this.AltRPCURL = altRPCURL;
   }
 
-  private async refreshEventFetchPageSize(): Promise<void> {
-    const res = await this.appConfigClient.fetchConfigRawString('EventsFetchPageSize');
-    this.EventFetchPageSize = parseInt(res, 10);
-  }
+  private async refreshEventFetchPageSize(): Promise<void> {}
 
   private async refreshEventQueueURL(): Promise<void> {

[Killed] BlockStatement
src/services/config/ConfigServiceAWS.ts:103:55
     this.EventFetchPageSize = parseInt(res, 10);
   }
 
-  private async refreshEventQueueURL(): Promise<void> {
-    this.EventQueueURL = await this.appConfigClient.fetchConfigRawString('NewEventsQueueURL');
-  }
+  private async refreshEventQueueURL(): Promise<void> {}
 }
 
killedBy: All tests
statusReason: > event-fetcher-backend@1.0.0 test
> npx nyc --reporter=lcov --reporter=text hardhat test


WARNING: You are currently using Node.js v21.2.0, which is not supported by Hardhat. This can lead to unexpected behavior. See https://hardhat.org/nodejs-versions
